In [13]:
import numpy as np
import pandas as pd

In [14]:
df = pd.read_csv('carprices.csv')
df.head()

   Mileage  Age(yrs)  Sell Price($)
0    69000         6          18000
1    35000         3          34000
2    57000         5          26100
3    22500         2          40000
4    46000         4          31500

X -> Feature   
y -> Target

In [15]:
X = df[['Mileage', 'Age(yrs)']]
X.head()

   Mileage  Age(yrs)
0    69000         6
1    35000         3
2    57000         5
3    22500         2
4    46000         4

In [16]:
y = df[['Sell Price($)']]
y.head()

   Sell Price($)
0          18000
1          34000
2          26100
3          40000
4          31500

In [17]:
from sklearn.model_selection import train_test_split

# train_test_split(features, target, test_size) constructor
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

In [19]:
X_train.head()

    Mileage  Age(yrs)
1     35000         3
10    83000         7
17    69000         5
2     57000         5
0     69000         6

In [20]:
X_test.head()

    Mileage  Age(yrs)
4     46000         4
3     22500         2
15    25400         3
7     72000         6
11    79000         7

In [21]:
y_train.head()

    Sell Price($)
1           34000
10          18700
17          19700
2           26100
0           18000

In [22]:
y_test.head()

    Sell Price($)
4           31500
3           40000
15          35000
7           19300
11          19500